{"id": "836312219902218242", "text": "Oscar’s biggest loser finally wins... on 21st try [SEP] Kevin O'Connell, Oscar's Biggest Loser, Finally Wins on 21st Try [Video]", "label": 1, "truth_mean": 0.66666666664, "truth_class": "clickbait"}
{"id": "857023964580904962", "text": "Live Nation CEO Michael Rapino: \"I don't want to be in the secondary biz at all\" [SEP] Live Nation CEO Michael Rapino: 'I Don't Want to Be In the Secondary Biz at All'", "label": 0, "truth_mean": 0.19999999997999998, "truth_class": "no-clickbait"}
{"id": "815011614667796480", "text": "New on @Medium: Why every generation feels entitled [SEP] Why every generation feels entitled [SEP] It’s a time-honoured tradition for older and younger generations of Australians to argue about whether government is treating them fairly. Our report Age of Entitlement, released last month, was…", "label": 1, "truth_mean": 0.66666666664, "truth_class": "clickbait"}
{"id": "818389857777152000", "text": "Donald Glover wins best performance by an actor in a TV series, comedy or musical at 2017 #GoldenGlobes [SEP] Donald Glover Wins Best Performance by an Actor in a TV Series, Comedy or Musical at 2017 Golden Globes [SEP] Donald Glover took home the Golden Globe for best performance by an actor in a TV series, comedy or musical on Sunday night for his starring role in FX's Atlanta.", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "806963531929255936", "text": "Breaking News: John Glenn has died at 95. He was the first American to orbit Earth, and later served in the Senate. [SEP] John Glenn, American Hero of the Space Age, Dies at 95 [SEP] Mr. Glenn was a symbol of the space age as the first American to orbit Earth, then became a national political figure representing Ohio in the Senate.", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "848641194045386752", "text": "Truck carrying 30,000 pounds of bananas crashes: [SEP] Truck carrying 30,000 pounds of bananas crashes in New Hampshire [SEP] New Hampshire police said the driver lost control of his vehicle because he was driving too fast in the snow", "label": 0, "truth_mean": 0.13333333332, "truth_class": "no-clickbait"}
{"id": "853732519107334144", "text": "The curious case of the billion-dollar lithium mine that sold on the cheap [SEP] Curious Case of Billion-Dollar Lithium Mine Sold for a Song [SEP] High in the Andes, in northwest Argentina, stories are told of fortunes being made in lithium, the wonder metal inside iPhones to Teslas that has captivated global investors from Warren Buffett down.", "label": 1, "truth_mean": 0.59999999994, "truth_class": "clickbait"}
{"id": "815596196379115521", "text": "It cost France $5 million to build the 1 km solar road used by 2,000 motorists per day [SEP] Expensive Solar Road Technology Makes First Appearance In France [SEP] At about $5 million per kilometer, it can hardly be considered a bargain.", "label": 0, "truth_mean": 0.13333333332, "truth_class": "no-clickbait"}
{"id": "844265735736188928", "text": "Opinion: \"Five questions after Comey’s testimony\" [SEP] Five questions after Comey’s testimony [SEP] Trump is acting like someone with something to hide.", "label": 0, "truth_mean": 0.06666666666, "truth_class": "no-clickbait"}
{"id": "851558803623620609", "text": "[SEP] Mick Mulvaney Orders Federal Agencies to Prepare for Massive Cuts [SEP] Mick Mulvaney Orders Federal Agencies to Prepare for Massive Cuts", "label": 1, "truth_mean": 0.6, "truth_class": "clickbait"}
{"id": "826402185823002624", "text": "Imagine a Fitbit tracker for your... erm... member -- that's what #Lovely is all about [SEP] A Silicone Ring Worn Around Your Penis Can Improve Your Sex Life Via An App. Lovely, Isn't It?", "label": 1, "truth_mean": 0.59999999998, "truth_class": "clickbait"}
{"id": "850203516563935233", "text": "So, what IS a Tomahawk Land Attack Missile? [SEP] Syrian Airfield Strike: What Is a Tomahawk Land Attack Missile? [SEP] Fifty-nine Tomahawk cruise missiles hit aircraft and infrastructure targets inside Syria on Thursday.", "label": 1, "truth_mean": 0.7333333333, "truth_class": "clickbait"}
{"id": "821309845089308674", "text": "Hamilton West End tickets are being sold by touts for obscene prices [SEP] Hamilton London tickets appear on resale sites for upwards of £2,000", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "852261375846084613", "text": "Trump says NATO allies must meet defense spending obligations [SEP] Trump Says NATO Allies Must Meet Defense Spending Obligation", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "848558222185287680", "text": "A running tally of all the Democrats voting against Neil Gorsuch: [SEP] These Are the Democrats Voting Against Neil Gorsuch [SEP] Judge Neil Gorsuch's appointment to the Supreme Court could hit a major road block next week when his nomination is expected to reach the Senate floor", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "810486452333248513", "text": "UN nuclear watchdog: Iran showing satisfactory commitment to nuclear deal [SEP] UN nuclear watchdog: Iran showing satisfactory commitment to nuclear deal [SEP] DUBAI (Reuters) - Iran has shown commitment to...", "label": 0, "truth_mean": 0.13333333332, "truth_class": "no-clickbait"}
{"id": "832901337104924672", "text": "Cars fall into Los Angeles sinkhole [SEP] Cars fall into Los Angeles sinkhole [SEP] The drama of cars tumbling into a sinkhole is shown on live TV.", "label": 1, "truth_mean": 0.5333333333, "truth_class": "clickbait"}
{"id": "818489754513801216", "text": "Russia, WikiLeaks push back on U.S. report on hacking. [SEP] Russia, WikiLeaks Push Back on US Report on Hacking [SEP] Russia, WikiLeaks Push Back on US Report on Hacking", "label": 0, "truth_mean": 0.19999999997999998, "truth_class": "no-clickbait"}
{"id": "838184054197452800", "text": "Traveling to Europe could get much more tricky [SEP] Americans Might Have to Get a Visa for Europe", "label": 1, "truth_mean": 0.66666666662, "truth_class": "clickbait"}
{"id": "852950046643453952", "text": "MOAB strike: US military defend use of massive bomb in Afghanistan [SEP] MOAB strike: US military defend use of massive bomb in Afghanistan [SEP] US and Afghan forces at the blast site reportedly saw no evidence of civilian casualties.", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "852865940937166849", "text": "Warren Beatty recalls 'chaos' of Oscars night [SEP] Warren Beatty recalls 'chaos' of Oscars night [SEP] Actor tells Graham Norton about handing the wrong envelope to Faye Dunaway, who announced the wrong winner for best film", "label": 0, "truth_mean": 0.3333333333, "truth_class": "no-clickbait"}
{"id": "831452937335496704", "text": "Judge rules states’ case challenging President Trump's travel order can proceed [SEP] Judge Rules States’ Case Against Trump Travel Order Can Proceed [SEP] The judge rejected the Justice Department's request to pause the original case in lower court while an appeals court sorts through the legal thicket.", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "857193971013046273", "text": "Inside the immigrant-prosecuting machine that transformed America's deportation policy [SEP] Inside The Immigrant-Prosecuting Machine That Transformed America's Deportation Policy [SEP] Democratic and Republican presidents spent two decades building Donald Trump's most powerful tool against undocumented immigrants.", "label": 0, "truth_mean": 0.3333333333, "truth_class": "no-clickbait"}
{"id": "821468537881403392", "text": "Blake Griffin and Ryan Kalil to produce “White Men Can’t Jump” remake [SEP] Blake Griffin and Ryan Kalil Will Produce 'White Men Can't Jump' Remake [SEP] Hollywood is planning to reboot yet another classic. Blake Griffin and Ryan Kalil are producing a remake of the iconic sports comedy White Men Can't Jump...", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "815593999222325248", "text": "Pope Francis says \"plague of terrorism\" is casting a bloodstain over the world [SEP] Pope Francis in New Year Address Says Terrorism Casts Bloodstain over World [SEP] The pope also said isolation caused by modern communication \"is cauterizing our hearts and making us lose the capacity for ... pity and compassion.\"", "label": 0, "truth_mean": 0.06666666666, "truth_class": "no-clickbait"}
{"id": "823095383194763264", "text": "Bet you didn't know government jobs paid so well :p [SEP] In Gujarat, A Government Peon Has 3 Flats, 3 Land Plots, 1 Office Space And Two Cars! [SEP] In Gujarat, A Government Peon Has 3 Flats, 3 Land Plots, 1 Office Space And Two Cars!", "label": 1, "truth_mean": 0.93333333332, "truth_class": "clickbait"}
{"id": "850098827143065600", "text": "[SEP] Rand: Rice Committed a Crime, ‘Did Something That’s Devastating’ [SEP] Rand: Rice Committed a Crime, 'Did Something That's Devastating'", "label": 1, "truth_mean": 0.66666666664, "truth_class": "clickbait"}
{"id": "824308438230515713", "text": "The Muslims, Sikhs and Hindus who have President Trump's ear [SEP] Trump's Hindu, Sikh and Muslim power brokers [SEP] Three men who supported Trump, despite their ethnic and religious communities' distaste for the president, now find themselves with the ear - for now - of the president.", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "815395169101029376", "text": "Trump says Happy New Year in the most Trump way [SEP] Trump says Happy New Year in the most Trump way [SEP] Trump chose to focus on a specific group in his initial New Year's message.", "label": 1, "truth_mean": 0.93333333332, "truth_class": "clickbait"}
{"id": "843590691800408064", "text": "'I wished I'd die': Harrowing account of life under ISIS [SEP] EXCLUSIVE: 'They made me wish I could die': Harrowing accounts of life under ISIS reveal teenager arrested for selling cigarettes narrowly escaped execution, and how girl, 7, was maimed by a landmine [SEP] In a heartbreaking video, teenager Adel revealed how he was tortured by the terror group, and saw dozens of people being rounded up to be killed.", "label": 0, "truth_mean": 0.3333333333, "truth_class": "no-clickbait"}
{"id": "814078279619608577", "text": "Daisy Ridley's touching tribute to 'predecessor' Carrie Fisher [SEP] Daisy Ridley's touching tribute to 'predecessor' Carrie Fisher [SEP] \"How awful that we have to say goodbye.\"", "label": 0, "truth_mean": 0.39999999995999996, "truth_class": "no-clickbait"}
{"id": "809349548334338048", "text": "The producer of \"Empire\" producer talks the midseason finale, that crushing farewell and ratings dip [SEP] 'Empire' Producer Talks Midseason Finale, That Crushing Farewell & Ratings Dip [SEP] Andre's descent into darkness reached a new crescendo on Wednesday's (Dec. 14) midseason finale of Empire.", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "839377902240169985", "text": "OracleVoice: What drives Linux Guru Wim Coekaerts? Have fun, build things people will use [SEP] OracleVoice: What Drives Linux Guru Wim Coekaerts? Have Fun, Build Things People Will Use [SEP] Wim Coekaerts has spent years guiding Oracle's efforts to make Linux, the open source operating system he’d played with since his school days in Belgium, its OS of record.", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "831210083971395585", "text": "What to expect from Pres. Trump's meeting with Canadian PM Trudeau [SEP] What to expect from Trump's meeting with Canadian PM Trudeau", "label": 0, "truth_mean": 0.33333333332, "truth_class": "no-clickbait"}
{"id": "851711435394736129", "text": "Three dead and one wounded in \"murder-suicide\" in San Bernardino elementary school [SEP] San Bernardino School Shooting: Three Dead, 1 Wounded in ‘Murder-Suicide’ in Classroom [SEP] A gunman opened fire inside his wife's elementary school classroom in San Bernardino on Monday, killing her and one a student before shooting himself.", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "843389115529945088", "text": "King maintains support in Iowa after inflammatory comments [SEP] King maintains support in Iowa after inflammatory comments [SEP] King maintains support in Iowa after inflammatory comments", "label": 0, "truth_mean": 0.13333333332, "truth_class": "no-clickbait"}
{"id": "852468948536881152", "text": "Melania Trump receives settlement from British paper [SEP] UK's Daily Mail to pay Melania Trump damages over modeling claims", "label": 0, "truth_mean": 0.39999999995999996, "truth_class": "no-clickbait"}
{"id": "805506289157730304", "text": "Trump vows 35% tax for US firms that move jobs overseas [SEP] Trump vows 35% tax for US firms that move jobs overseas [SEP] Donald Trump threatens to impose a 35% tax on US companies that move their manufacturing overseas.", "label": 0, "truth_mean": 0.06666666666, "truth_class": "no-clickbait"}
{"id": "845255620597047296", "text": "Donald Trump's dizzying Time magazine interview was 'Trumpspeak' on display | Douglas Lawrence [SEP] Donald Trump's dizzying Time magazine interview was 'Trumpspeak' on display [SEP] The Time interview provides unusual insight into the principles and deep structure of Trumpspeak, the political discourse distorting our democracy", "label": 0, "truth_mean": 0.39999999995999996, "truth_class": "no-clickbait"}
{"id": "834175908525256705", "text": "A rogue bull escaped its fate at a Queens slaughterhouse and led authorities on a 2-mile chase [SEP] Runaway Bull Barrels Through New York Neighborhood Before Dying [SEP] A rogue bull escaped its fate at a Queens slaughterhouse and led authorities on a 2-mile chase, before dying shortly after it was captured.", "label": 0, "truth_mean": 0.13333333332, "truth_class": "no-clickbait"}
{"id": "858332122767077376", "text": "Wow, Instagram has a lot of followers. [SEP] This week in apps: Instagram hits 700 million, Apple's new music deal, and more [SEP] The apps that caught our eye this week.", "label": 1, "truth_mean": 0.93333333332, "truth_class": "clickbait"}
{"id": "836450999980064768", "text": "🛌💤 Red Sox upgrade Fenway sleep room to give players better naps [SEP] Red Sox Upgrade Fenway Sleep Room to Give Players Better Naps [SEP] The Red Sox know that catching more Z's equals catching more balls on the field. In fact, sleep is so important to the team that it is overhauling naptime for players and coaches...", "label": 0, "truth_mean": 0.13333333332, "truth_class": "no-clickbait"}
{"id": "816678245592612864", "text": "Harvard Academic says if the latest bond market bubble bursts, it will be worse than 1994 [SEP] Harvard Academic Sees Debt Rout Worse Than 1994 ‘Bond Massacre’ [SEP] If you thought you had already read the gloomiest possible prognosis for bonds, wait until you read this one.", "label": 0, "truth_mean": 0.2, "truth_class": "no-clickbait"}
{"id": "809338679080681472", "text": "Bank governor tells Iceland: You need to sober up [SEP] Booming Iceland Needs to Sober Up, Governor Warns After Rate Cut [SEP] Iceland will need to pursue a more sober fiscal policy if it wants to avoid a hangover from its latest high-growth binge, according to the governor of the country’s central bank.", "label": 0, "truth_mean": 0.19999999997999998, "truth_class": "no-clickbait"}
{"id": "817045898807144450", "text": "Chelsea Handler to lead 'Women's March' at Sundance (Exclusive) [SEP] Chelsea Handler to lead 'Women's March' at the Sundance Film Festival [SEP] The demonstration will coincide with the Women's March in Washington, D.C.", "label": 0, "truth_mean": 0.06666666666, "truth_class": "no-clickbait"}
{"id": "856059580866076672", "text": "Cherokee Nation files first-of-its-kind opioid lawsuit against Wal-Mart, CVS and Walgreens [SEP] Cherokee Nation files first-of-its-kind opioid lawsuit against Wal-mart, CVS, Walgreens [SEP] The tribe says drug stores and distributors have contributed to “an epidemic of prescription opioid abuse” among its members", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "838966440774483968", "text": "Twitter briefly suspended former Ku Klux Klan leader David Duke [SEP] Twitter briefly suspends David Duke [SEP] The white nationalist leader was banned from the site.", "label": 0, "truth_mean": 0.19999999997999998, "truth_class": "no-clickbait"}
{"id": "812882065855279104", "text": "For her school's \"Superhero Day,\" an 8-year-old dresses up as Ruth Bader Ginsburg: [SEP] Girl, 8, dresses up as Ruth Bader Ginsburg", "label": 0, "truth_mean": 0.06666666666, "truth_class": "no-clickbait"}
{"id": "851516892238008320", "text": "This woman sneaking pictures of The Rock's butt is you, me, and your grandma [SEP] This Woman Sneaking Pictures Of The Rock's Butt Is Human Goals", "label": 1, "truth_mean": 0.6, "truth_class": "clickbait"}
{"id": "837417242086236161", "text": ".@LukeBryanOnline teases family-focused \"Fast\" music video (exclusive) [SEP] Luke Bryan Teases Family-Focused 'Fast' Music Video: Exclusive Preview [SEP] Country superstar Luke Bryan will release a music video for his latest single \"Fast\" on Friday, but Billboard can exclusively share this 30-second preview now.", "label": 0, "truth_mean": 0.19999999997999998, "truth_class": "no-clickbait"}
{"id": "847829590680711169", "text": "The 5 characters who are most likely die in The Walking Dead season 7 finale [SEP] The Walking Dead season 7 finale episode: The 5 characters who might die", "label": 1, "truth_mean": 0.73333333332, "truth_class": "clickbait"}
{"id": "847460797819367424", "text": "Trump: \"We must fight\" hard-line conservative Freedom Caucus in 2018 midterm elections [SEP] Trump: ‘We must fight’ hard-line conservative Freedom Caucus in 2018 midterm elections [SEP] There are about 32 members of the Freedom Caucus, most of them elected or reelected comfortably in solidly Republican districts.", "label": 0, "truth_mean": 0.2, "truth_class": "no-clickbait"}
{"id": "853813597226627072", "text": "Players across the NBA had messages for IT4 after his emotional night. [SEP] Sports community shows support for Isaiah Thomas following Game 1 loss to Bulls [SEP] Many players from across the league and celebrities expressed their admiration for Isaiah Thomas' decision to play on Sunday, just one day after the tragic loss of his younger sister, Chyna.", "label": 0, "truth_mean": 0.33333333332, "truth_class": "no-clickbait"}
{"id": "851209366187499521", "text": "North Korea says U.S. airstrike against Syria prove its nuclear weapons are justified. [SEP] North Korea says Syria airstrikes prove its nukes justified [SEP] North Korea says Syria airstrikes prove its nukes justified", "label": 0, "truth_mean": 0.13333333332, "truth_class": "no-clickbait"}
{"id": "830471485030547457", "text": "Bye bye, Bao Bao: National zoo reveals date panda will leave for China via @NBCWashington [SEP] Bye Bye, Bao Bao: National Zoo Reveals Date Panda Will Leave for China [SEP] The National Zoo revealed Monday that Bao Bao, its 3-year-old giant panda, will move to China Feb. 21.", "label": 0, "truth_mean": 0.19999999997999998, "truth_class": "no-clickbait"}
{"id": "811480076105682944", "text": "Fox News Poll: 2016 election battle continues -- at home [SEP] Fox News Poll: 2016 election battle continues -- at home [SEP] It’s best to avoid politics this holiday season if you want to remain on speaking terms with those dear to you. That advice is courtesy of the latest Fox News Poll.", "label": 0, "truth_mean": 0.19999999997999998, "truth_class": "no-clickbait"}
{"id": "822701515328684032", "text": "How Donald Trump's #inauguration speech played on Capitol Hill [SEP] How Trump's speech played on Capitol Hill [SEP] Different ears heard different things during Donald Trump's inaugural speech to the nation.", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "841017845345542144", "text": "Sara Connor to learn her fate over death of #Bali police officer (Pic: AP) [SEP] Sara Connor: What to expect from inside the courtroom ahead of verdict in Bali murder trial [SEP] An Australian woman will learn her fate in a Bali court this afternoon, after seven months behind bars for her alleged involvement in the killing of an on-duty police officer in Bali.", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "812395131374604289", "text": "Russian robbers bungle mobile phone shop raid after their stun gun breaks [SEP] Robbers bungle mobile phone shop raid when the stun gun they attack the assistant with turns out to be BROKEN [SEP] Bungling robbers were left brawling with a shop assistant in Russia when they tried to attack him, and found their stun gun wasn't working. The assistant becomes angry and fights back.", "label": 0, "truth_mean": 0.06666666666, "truth_class": "no-clickbait"}
{"id": "815210194829451264", "text": "Ronda Rousey loses again; what now? #ufc207 [SEP] Ronda Rousey Loses Again; What Now? [SEP] The UFC’s best-known fighter, Ronda Rousey, suffered her second consecutive brutal defeat, this time at the hands of Brazilian Amanda Nunes.", "label": 0, "truth_mean": 0.39999999995999996, "truth_class": "no-clickbait"}
{"id": "832829891640958976", "text": "Watch these politicians morph into their 'SNL' characters [SEP] Watch These Politicians Morph Into Their 'SNL' Characters [SEP] So... who's really who?", "label": 0, "truth_mean": 0.46666666666, "truth_class": "no-clickbait"}
{"id": "805736075645878272", "text": "Even credit/debit cards aren't safe #demonetisation [SEP] VISA Debit, Credit Cards Can Be Hacked In Just A Few Seconds, Finds A Research In UK [SEP] AN article about Bank card hacking", "label": 1, "truth_mean": 0.7333333333, "truth_class": "clickbait"}
{"id": "813976158253580289", "text": "Ricky Harris of \"Everybody Hates Chris\" dies at 54 [SEP] Ricky Harris, 'Everybody Hates Chris' Actor, Dead At 54 [SEP] The comedian's cause of death has yet to be confirmed.", "label": 0, "truth_mean": 0.06666666666, "truth_class": "no-clickbait"}
{"id": "821756837129310208", "text": "Without Blake Griffin and now Chris Paul, what’s next for the Clippers? [SEP] What's Next for LA Clippers Following Chris Paul's Latest Injury?", "label": 1, "truth_mean": 0.5333333333, "truth_class": "clickbait"}
{"id": "854892491174182912", "text": "What happens when you don't shave for a whole year? Natural beauty, explains this blogger 🙌 [SEP] This Brave Fitness Blogger Reveals Her Hairy Legs and Armpits, After Not Shaving For a Year To Encourage Natural Beauty [SEP] This Brave Fitness Blogger Reveals Her Hairy Legs and Armpits, After Not Shaving For a Year To Encourage Natural Beauty", "label": 1, "truth_mean": 0.59999999998, "truth_class": "clickbait"}
{"id": "814548215878000640", "text": "The best fast food, picked by the world's top chefs [SEP] The Best Fast Food, Picked by the World’s Top Chefs [SEP] Who knew the man behind the Gramercy Tavern's $125 dinner Tasting Menu loves Popeye's fried chicken with dirty rice and biscuits?", "label": 1, "truth_mean": 0.6, "truth_class": "clickbait"}
{"id": "836059559194144769", "text": "See the nominees who brought a relative to the #Oscars via @TODAYshow [SEP] Family night! See the nominees who brought a relative to the Oscars [SEP] Emma Stone brought her brother. Viggo Mortensen brought his son. And three nominees brought their mother.", "label": 1, "truth_mean": 0.59999999996, "truth_class": "clickbait"}
{"id": "833043013253345282", "text": "The blind sheik behind terror plots in the U.S. in the 1990s has died in an American prison at age 78. [SEP] Omar Abdel-Rahman, ‘Blind Sheik’ in 1993 Trade Center Attack, Dies [SEP] Omar Abdel-Rahman, the so-called Blind Sheik convicted of plotting terror attacks in the U.S. in the 1990s, has died. He was 78 years old.", "label": 0, "truth_mean": 0.19999999997999998, "truth_class": "no-clickbait"}
{"id": "830100390574170114", "text": "Japan's PM Abe 'seeks trust with Trump' on US visit [SEP] Trump tells Abe: US-Japan ties are 'cornerstone of peace' [SEP] After talks with PM Shinzo Abe, Donald Trump says the US is committed to \"the security of Japan\".", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "815027954598248452", "text": "The northeast will ring in the New Year with delays, snow and cold [SEP] The northeast will ring in the New Year with delays, snow and cold [SEP] The northeast has seen snow, power outages and travel woes thanks to some intense winter weather", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "851055095626309633", "text": "Neil Gorsuch’s ascent shines a light on Washington’s close-knit legal world [SEP] Neil Gorsuch’s Ascent Highlights Washington’s Close-Knit Legal World", "label": 0, "truth_mean": 0.06666666666, "truth_class": "no-clickbait"}
{"id": "840215707648425984", "text": "Morning Briefing: Here's what you need to know to start your day [SEP] South Korea, Republican Party, Jobs Report: Your Friday Briefing [SEP] Here’s what you need to know to start your day.", "label": 0, "truth_mean": 0.3333333333, "truth_class": "no-clickbait"}
{"id": "805080554714595330", "text": "Why is the Turner prize failing to engage with politics? [SEP] Why is the Turner prize failing to engage with politics? [SEP] With the arts under pressure, the Turner should bring audiences into contact with work that reflects the political realities of our times. Instead, it’s playing it safe", "label": 0, "truth_mean": 0.46666666661999995, "truth_class": "no-clickbait"}
{"id": "826369460768485376", "text": "Diplomats say Trump's immigration order will not make America more safe [SEP] Diplomats Say Immigration Order Will Not Make America More Safe [SEP] Hundreds of foreign service officers are expected to submit a dissent memo against the President's decision to ban all refugees for 120 days and block travel to the U.S. from seven countries.", "label": 0, "truth_mean": 0.2, "truth_class": "no-clickbait"}
{"id": "834937560052940800", "text": "Press Secretary says there will be 'greater enforcement' of marijuana laws: [SEP] Press Secretary Says There Will Be 'Greater Enforcement' of Marijuana Laws [SEP] President Donald Trump plans to mount a serious defense against recreational marijuana use, according to his press secretary.", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "843224605007532032", "text": "Ivanka Trump said her dad cared about child care. The president's budget says otherwise. [SEP] Ivanka Trump Said Her Dad Cared About Child Care. His Budget Says Otherwise. [SEP] The president wants to cut after-school programs that low-income working parents rely on.", "label": 0, "truth_mean": 0.13333333332, "truth_class": "no-clickbait"}
{"id": "830806197607464962", "text": "Leslie Jones baits Donald Trump on #SNL [SEP] Watch Leslie Jones Bait Donald Trump on 'Saturday Night Live' [SEP] Leslie Jones portrayed Donald Trump on 'Saturday Night Live.'", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "847807037501210624", "text": "Hijab and rap – do they mix? Mona Haydar, a Syrian-American Muslim activist, certainly thinks so [SEP] BBC Trending [SEP] Find out what's buzzing in the social media world today.", "label": 0, "truth_mean": 0.39999999997999997, "truth_class": "no-clickbait"}
{"id": "852973306546356224", "text": "Your grandparents totally understand emoji (except maybe this one:🍆 ) [SEP] Yes, old people totally understand emoji (except maybe that eggplant one) [SEP] Oh, and there was just a tad bit of confusion about 💩.", "label": 1, "truth_mean": 0.86666666664, "truth_class": "clickbait"}
{"id": "847530145263079424", "text": "'Legion' murked every other comic book show out there [SEP] ‘Legion’ Murked Every Comic Book Show Moving [SEP] If you&#39;re not up on &#39;Legion,&#39; you&#39;re playing yourself.", "label": 0, "truth_mean": 0.26666666666, "truth_class": "no-clickbait"}
{"id": "833297255310450688", "text": "How can we take the Trump administration seriously when it can't even spell good? [SEP] How Can We Take The Trump Administration Seriously When It Can't Even Spell? [SEP] You know it's gotten bad when the dictionary feels the need to weigh in.", "label": 1, "truth_mean": 0.5333333333, "truth_class": "clickbait"}
{"id": "840696091721027586", "text": "White House fence jumper told Secret Service, 'I am a friend of the president. I have an appointment' [SEP] Intruder Arrested After Scaling White House Fence [SEP] The intruder climbed a fence protecting the east side of the White House on Friday night and proceeded to the South grounds before he was stopped.", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "832487496382562305", "text": "Trump praises Priebus in face of critical stories [SEP] Trump praises Priebus in face of critical stories", "label": 0, "truth_mean": 0.39999999995999996, "truth_class": "no-clickbait"}
{"id": "808247308458532868", "text": "#SNL recap: John Cena goes bananas [SEP] ‘SNL’ Recap: John Cena Goes Bananas", "label": 0, "truth_mean": 0.46666666664, "truth_class": "no-clickbait"}
{"id": "814312488598642688", "text": "The 100 best Cher tweets of 2016 [SEP] 100 Of Cher’s Best Tweets From 2016", "label": 0, "truth_mean": 0.5333333333, "truth_class": "no-clickbait"}
{"id": "829400970522218496", "text": "Security expert says hackers can attack your device via dozens of popular iOS apps [SEP] Is YOUR phone safe? Security expert says hackers can attack your device via dozens of popular iOS apps [SEP] According to Will Strafach, CEO of New-York based Sudo Security Group, there are dozens of iPhone apps which are at risk of being hacked. They include apps such as Music Tube and Gift Saga.", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "809093095543316480", "text": "Kanye West reveals Donald Trump signed a copy of Time Magazine for him after hinting at plans to run for president [SEP] Kanye West reveals Donald Trump signed a copy of Time Magazine for him after hinting at plans to run for president in 2024 [SEP] Kanye West posted a picture of a signed copy of Time Magazine, given to him by Donald Trump, on Twitter.", "label": 0, "truth_mean": 0.13333333332, "truth_class": "no-clickbait"}
{"id": "831904658163585035", "text": "A psychologist has created a photo series to help people talk about mental health [SEP] A Psychologist Has Turned His Patients’ Experience Of Mental Health Issues Into Stunning Photos", "label": 0, "truth_mean": 0.26666666666, "truth_class": "no-clickbait"}
{"id": "814146156997595140", "text": "How the constant threat of war shaped Israel’s technology industry [SEP] How the Constant Threat of War Shaped Israel’s Tech Industry [SEP] Hello World, Episode 3: Visit a technology giant with thousands of cutting-edge startups.", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "840008198429925376", "text": "18 tiny jokes so hidden in \"Community\" that you probably never noticed [SEP] 18 Times “Community” Snuck In Hilarious Little Jokes That You Might’ve Missed", "label": 1, "truth_mean": 0.59999999998, "truth_class": "clickbait"}
{"id": "819299440297132032", "text": "Fury over India flag doormats for sale on Amazon [SEP] Fury over India flag doormats for sale on Amazon [SEP] India's foreign minister threatens to rescind visas for Amazon staff over the \"insulting\" doormats.", "label": 0, "truth_mean": 0.13333333332, "truth_class": "no-clickbait"}
{"id": "824005382532136961", "text": "\"Oscar nominations: The diversity is impressive. Now time for a long-lasting reset.\" [SEP] Oscar nominations: The diversity is impressive. Now time for a long-lasting reset. [SEP] CRITIC’S NOTEBOOK | After complaints about underrepresentation, African American filmmakers break records. Is that enough?", "label": 0, "truth_mean": 0.39999999995999996, "truth_class": "no-clickbait"}
{"id": "833338612246839296", "text": "Student debt in America has hit a new record [SEP] Student Debt in America Has Hit a New Record [SEP] President Trump has called student debt an \"anchor\" weighing down young Americans.", "label": 0, "truth_mean": 0.26666666664, "truth_class": "no-clickbait"}
{"id": "820159765359669249", "text": "New Hampshire family plans bucket list for 9-year-old with terminal brain tumor [SEP] New Hampshire family plans bucket list for 9-year-old with terminal brain tumor [SEP] In just a few short weeks, 9-year-old Ciara Brills’ life has changed dramatically.", "label": 1, "truth_mean": 0.5333333333, "truth_class": "clickbait"}
{"id": "851410205988577280", "text": "Packaged salad recalled after dead bats found inside [SEP] Dead Bat Discovered in Salad Mixes Prompts Recalls From Walmart [SEP] Two people reported finding the dead bat", "label": 0, "truth_mean": 0.4, "truth_class": "no-clickbait"}
{"id": "836018062419767296", "text": "It's Oscar Night! So we've got a question: No, not who will win. How well do you know your Disney sports movies? [SEP] Quiz: How well do you know your Disney sports movies? [SEP] Are you a Remember the Titans junkie? An Air Bud-head? A Mighty Ducks maniac? Then this quiz is for you.", "label": 1, "truth_mean": 0.66666666664, "truth_class": "clickbait"}
{"id": "840385554726412288", "text": "South Korean president's ouster to trigger shift on U.S. policy [SEP] South Korean President Park Geun-hye’s Ouster to Trigger Shift on U.S. Policy [SEP] The ouster of Park Geun-hye triggered an election that likely will install a leader who is more skeptical of U.S. foreign-policy objectives in Northeast Asia.", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "828982237496492033", "text": "\"Glass House\" is the sad story of how corporate America raided an Ohio glass manufacturer [SEP] The ‘Slow-Motion Terrorism of Pirate Capitalism’ [SEP] Glass House is the sad story of how corporate America raided a glass manufacturer and left an Ohio town reeling.", "label": 0, "truth_mean": 0.06666666666, "truth_class": "no-clickbait"}
{"id": "811981532508422148", "text": "Trump wants expanded nuclear capability [SEP] Donald Trump: US must greatly expand nuclear capabilities [SEP] Donald Trump calls for the US to \"greatly strengthen and expand\" its nuclear capabilities.", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
{"id": "810994413409357824", "text": "The truck's path through a crowded Christmas market in Berlin [SEP] The Truck’s Path Through a Crowded Christmas Market in Berlin [SEP] The truck could be seen afterward on one edge of the market after having traveled about 250 feet through stalls and shoppers.", "label": 0, "truth_mean": 0.0, "truth_class": "no-clickbait"}
